app/controllers/devise/ajax_registrations_controller.rb

  def create
    build_resource(sign_up_params)
Rails.logger.info "resource built #{resource.inspect}"
    if resource.save

      # Create an OAuth2 Access token to be rendered
      token = Doorkeeper::AccessToken.where(
        application_id: 1,
        resource_owner_id: resource.id,
        revoked_at: nil
      ).order(:created_at).last

      if !token || token.expired?
        Doorkeeper::AccessToken.create!(
          application_id: 1,
          resource_owner_id: resource.id
        )
---
SELECT "oauth_access_tokens".* FROM "oauth_access_tokens" WHERE "oauth_access_tokens"."application_id" = 1 AND "oauth_access_tokens"."resource_owner_id" = 5 AND "oauth_access_tokens"."revoked_at" IS NULL ORDER BY "oauth_access_tokens"."created_at" DESC LIMIT 1
INSERT INTO "oauth_access_tokens" ("application_id", "created_at", "resource_owner_id", "token") VALUES ($1, $2, $3, $4) RETURNING "id"  [["application_id", 1], ["created_at", Mon, 03 Mar 2014 21:10:13 UTC +00:00], ["resource_owner_id", 5], ["token", "00612b8a441f0706b78ad77d6f3f02919fbc829c1b309e34560657deb98cd0a9"]]